app/controllers/articles_controller.rb

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
---
  def show
    @article = Article.find params[:id]

INSERT INTO "articles" ("created_at", "title", "body", "updated_at") VALUES('2010-09-20 20:55:50', 'Overriding a .svc Request With Routing', '		<p>I was drawn to an <a title="Override .svc file" href="http://stackoverflow.com/questions/3662555/how-can-i-override-a-svc-file-in-my-routing-table">interesting question on StackOverflow</a> recently about how to override a request for a non-existent .svc request using routing.</p> <p>One useful feature of routing in ASP.NET is that requests for files that exist on disk are ignored by routing. Thus requests for static files and for .aspx and .svc files don’t run through the routing system.</p> <p>In this particular scenario, the developer wanted to replace an existing .svc service with a call to an ASP.NET MVC controller. So he deletes the .svc file and adds the following route:</p> <div class="dropshadow code"> <div class="innerbox"> <pre class="csharpcode">routes.MapRoute(
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES('asp.net mvc', '2010-09-20 20:55:50', '2010-09-20 20:55:50')
---
  def create
    @article = Article.new params[:article]
    tags = Tag.get_tag_list_from_comma_list(params[:tags])
    @article.tags = tags
    @article.save